Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/efuse.h
/*
 * Component description for EFUSE
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_EFUSE_COMPONENT_H_
#define _PIC32WM_BZ6_EFUSE_COMPONENT_H_

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR EFUSE                      */
/* ************************************************************************** */

/* -------- EFUSE_SECCFG0 : (EFUSE Offset: 0x00) (R/W 8) Secure Configuration -------- */
#define EFUSE_SECCFG0_RESETVALUE              _UINT8_(0x00)                                        /*  (EFUSE_SECCFG0) Secure Configuration  Reset Value */

#define EFUSE_SECCFG0_UUID_LCK_Pos            _UINT8_(4)                                           /* (EFUSE_SECCFG0) Programming lock bits for Unique ID fuses Position */
#define EFUSE_SECCFG0_UUID_LCK_Msk            (_UINT8_(0x3) << EFUSE_SECCFG0_UUID_LCK_Pos)         /* (EFUSE_SECCFG0) Programming lock bits for Unique ID fuses Mask */
#define EFUSE_SECCFG0_UUID_LCK(value)         (EFUSE_SECCFG0_UUID_LCK_Msk & (_UINT8_(value) << EFUSE_SECCFG0_UUID_LCK_Pos)) /* Assignment of value for UUID_LCK in the EFUSE_SECCFG0 register */
#define   EFUSE_SECCFG0_UUID_LCK_0_Val        _UINT8_(0x0)                                         /* (EFUSE_SECCFG0) Unique ID is not locked  */
#define   EFUSE_SECCFG0_UUID_LCK_1_Val        _UINT8_(0x1)                                         /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed  */
#define   EFUSE_SECCFG0_UUID_LCK_2_Val        _UINT8_(0x2)                                         /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed  */
#define   EFUSE_SECCFG0_UUID_LCK_3_Val        _UINT8_(0x3)                                         /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed  */
#define EFUSE_SECCFG0_UUID_LCK_0              (EFUSE_SECCFG0_UUID_LCK_0_Val << EFUSE_SECCFG0_UUID_LCK_Pos) /* (EFUSE_SECCFG0) Unique ID is not locked Position */
#define EFUSE_SECCFG0_UUID_LCK_1              (EFUSE_SECCFG0_UUID_LCK_1_Val << EFUSE_SECCFG0_UUID_LCK_Pos) /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed Position */
#define EFUSE_SECCFG0_UUID_LCK_2              (EFUSE_SECCFG0_UUID_LCK_2_Val << EFUSE_SECCFG0_UUID_LCK_Pos) /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed Position */
#define EFUSE_SECCFG0_UUID_LCK_3              (EFUSE_SECCFG0_UUID_LCK_3_Val << EFUSE_SECCFG0_UUID_LCK_Pos) /* (EFUSE_SECCFG0) Unique ID is locked and cannot be programmed Position */
#define EFUSE_SECCFG0_DEBUG_LCK_Pos           _UINT8_(6)                                           /* (EFUSE_SECCFG0) Lock bits for debug/programming Position */
#define EFUSE_SECCFG0_DEBUG_LCK_Msk           (_UINT8_(0x3) << EFUSE_SECCFG0_DEBUG_LCK_Pos)        /* (EFUSE_SECCFG0) Lock bits for debug/programming Mask */
#define EFUSE_SECCFG0_DEBUG_LCK(value)        (EFUSE_SECCFG0_DEBUG_LCK_Msk & (_UINT8_(value) << EFUSE_SECCFG0_DEBUG_LCK_Pos)) /* Assignment of value for DEBUG_LCK in the EFUSE_SECCFG0 register */
#define   EFUSE_SECCFG0_DEBUG_LCK_0_Val       _UINT8_(0x0)                                         /* (EFUSE_SECCFG0) Debug is not locked  */
#define   EFUSE_SECCFG0_DEBUG_LCK_1_Val       _UINT8_(0x1)                                         /* (EFUSE_SECCFG0) Debug is locked  */
#define   EFUSE_SECCFG0_DEBUG_LCK_2_Val       _UINT8_(0x2)                                         /* (EFUSE_SECCFG0) Debug is locked  */
#define   EFUSE_SECCFG0_DEBUG_LCK_3_Val       _UINT8_(0x3)                                         /* (EFUSE_SECCFG0) Debug is locked  */
#define EFUSE_SECCFG0_DEBUG_LCK_0             (EFUSE_SECCFG0_DEBUG_LCK_0_Val << EFUSE_SECCFG0_DEBUG_LCK_Pos) /* (EFUSE_SECCFG0) Debug is not locked Position */
#define EFUSE_SECCFG0_DEBUG_LCK_1             (EFUSE_SECCFG0_DEBUG_LCK_1_Val << EFUSE_SECCFG0_DEBUG_LCK_Pos) /* (EFUSE_SECCFG0) Debug is locked Position */
#define EFUSE_SECCFG0_DEBUG_LCK_2             (EFUSE_SECCFG0_DEBUG_LCK_2_Val << EFUSE_SECCFG0_DEBUG_LCK_Pos) /* (EFUSE_SECCFG0) Debug is locked Position */
#define EFUSE_SECCFG0_DEBUG_LCK_3             (EFUSE_SECCFG0_DEBUG_LCK_3_Val << EFUSE_SECCFG0_DEBUG_LCK_Pos) /* (EFUSE_SECCFG0) Debug is locked Position */
#define EFUSE_SECCFG0_Msk                     _UINT8_(0xF0)                                        /* (EFUSE_SECCFG0) Register Mask  */


/* -------- EFUSE_SECCFG1 : (EFUSE Offset: 0x01) (R/W 8) Secure Configuration -------- */
#define EFUSE_SECCFG1_RESETVALUE              _UINT8_(0x00)                                        /*  (EFUSE_SECCFG1) Secure Configuration  Reset Value */

#define EFUSE_SECCFG1_ROOT_KEY_LCK_Pos        _UINT8_(0)                                           /* (EFUSE_SECCFG1) Lock bits for storage root Key Position */
#define EFUSE_SECCFG1_ROOT_KEY_LCK_Msk        (_UINT8_(0x3) << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos)     /* (EFUSE_SECCFG1) Lock bits for storage root Key Mask */
#define EFUSE_SECCFG1_ROOT_KEY_LCK(value)     (EFUSE_SECCFG1_ROOT_KEY_LCK_Msk & (_UINT8_(value) << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos)) /* Assignment of value for ROOT_KEY_LCK in the EFUSE_SECCFG1 register */
#define   EFUSE_SECCFG1_ROOT_KEY_LCK_0_Val    _UINT8_(0x0)                                         /* (EFUSE_SECCFG1) Storage root key is not locked  */
#define   EFUSE_SECCFG1_ROOT_KEY_LCK_1_Val    _UINT8_(0x1)                                         /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed  */
#define   EFUSE_SECCFG1_ROOT_KEY_LCK_2_Val    _UINT8_(0x2)                                         /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed  */
#define   EFUSE_SECCFG1_ROOT_KEY_LCK_3_Val    _UINT8_(0x3)                                         /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed  */
#define EFUSE_SECCFG1_ROOT_KEY_LCK_0          (EFUSE_SECCFG1_ROOT_KEY_LCK_0_Val << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Storage root key is not locked Position */
#define EFUSE_SECCFG1_ROOT_KEY_LCK_1          (EFUSE_SECCFG1_ROOT_KEY_LCK_1_Val << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_ROOT_KEY_LCK_2          (EFUSE_SECCFG1_ROOT_KEY_LCK_2_Val << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_ROOT_KEY_LCK_3          (EFUSE_SECCFG1_ROOT_KEY_LCK_3_Val << EFUSE_SECCFG1_ROOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Storage root key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_Pos        _UINT8_(2)                                           /* (EFUSE_SECCFG1) Lock bits for Secure Boot/OTA Key Position */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_Msk        (_UINT8_(0x3) << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos)     /* (EFUSE_SECCFG1) Lock bits for Secure Boot/OTA Key Mask */
#define EFUSE_SECCFG1_BOOT_KEY_LCK(value)     (EFUSE_SECCFG1_BOOT_KEY_LCK_Msk & (_UINT8_(value) << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos)) /* Assignment of value for BOOT_KEY_LCK in the EFUSE_SECCFG1 register */
#define   EFUSE_SECCFG1_BOOT_KEY_LCK_0_Val    _UINT8_(0x0)                                         /* (EFUSE_SECCFG1) Secure boot key is not locked  */
#define   EFUSE_SECCFG1_BOOT_KEY_LCK_1_Val    _UINT8_(0x1)                                         /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed  */
#define   EFUSE_SECCFG1_BOOT_KEY_LCK_2_Val    _UINT8_(0x2)                                         /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed  */
#define   EFUSE_SECCFG1_BOOT_KEY_LCK_3_Val    _UINT8_(0x3)                                         /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed  */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_0          (EFUSE_SECCFG1_BOOT_KEY_LCK_0_Val << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Secure boot key is not locked Position */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_1          (EFUSE_SECCFG1_BOOT_KEY_LCK_1_Val << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_2          (EFUSE_SECCFG1_BOOT_KEY_LCK_2_Val << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_BOOT_KEY_LCK_3          (EFUSE_SECCFG1_BOOT_KEY_LCK_3_Val << EFUSE_SECCFG1_BOOT_KEY_LCK_Pos) /* (EFUSE_SECCFG1) Secure boot key is locked and cannot be programmed Position */
#define EFUSE_SECCFG1_Msk                     _UINT8_(0x0F)                                        /* (EFUSE_SECCFG1) Register Mask  */


/* -------- EFUSE_SECCFG2 : (EFUSE Offset: 0x02) (R/W 8) Secure Configuration -------- */
#define EFUSE_SECCFG2_RESETVALUE              _UINT8_(0x00)                                        /*  (EFUSE_SECCFG2) Secure Configuration  Reset Value */

#define EFUSE_SECCFG2_ADD_BOOT_KEY_Pos        _UINT8_(0)                                           /* (EFUSE_SECCFG2) Additional boot Key bit Position */
#define EFUSE_SECCFG2_ADD_BOOT_KEY_Msk        (_UINT8_(0x1) << EFUSE_SECCFG2_ADD_BOOT_KEY_Pos)     /* (EFUSE_SECCFG2) Additional boot Key bit Mask */
#define EFUSE_SECCFG2_ADD_BOOT_KEY(value)     (EFUSE_SECCFG2_ADD_BOOT_KEY_Msk & (_UINT8_(value) << EFUSE_SECCFG2_ADD_BOOT_KEY_Pos)) /* Assignment of value for ADD_BOOT_KEY in the EFUSE_SECCFG2 register */
#define EFUSE_SECCFG2_Msk                     _UINT8_(0x01)                                        /* (EFUSE_SECCFG2) Register Mask  */


/* -------- EFUSE_ANTIROLLBACKCOUNTER : (EFUSE Offset: 0x04) (R/W 8) Anti Roll back counter -------- */
#define EFUSE_ANTIROLLBACKCOUNTER_RESETVALUE  _UINT8_(0x00)                                        /*  (EFUSE_ANTIROLLBACKCOUNTER) Anti Roll back counter  Reset Value */

